README.md
```mermaid
erDiagram
    dim_movies ||--|| fact_movies_performance : "1 : 1"
    dim_movies ||--o{ dim_reviews : "1 : 1 (Resumido)"
    dim_movies ||--o{ bridge_movie_genre : "1 : N"
    dim_genres ||--o{ bridge_movie_genre : "1 : N"
    dim_movies ||--o{ bridge_movie_person : "1 : N"
    dim_people ||--o{ bridge_movie_person : "1 : N"
    dim_movies ||--o{ bridge_movie_company : "1 : N"
    dim_companies ||--o{ bridge_movie_company : "1 : N"

    dim_movies {
        bigint sk_movie_id PK
        string id_filme
        string titulo
        date data_lancamento
        int ano_lancamento
        int duracao_minutos
        string idioma_original
        string status_filme
        string sinopse
    }

    fact_movies_performance {
        bigint sk_movie_id PK_FK
        decimal orcamento_usd
        decimal receita_usd
        decimal lucro_usd
        decimal orcamento_brl
        decimal receita_brl
        decimal lucro_brl
        double popularidade
        double nota_media_tmdb
        int qtd_votos_tmdb
        double nota_media_imdb
        int qtd_votos_imdb
    }

    dim_genres {
        bigint sk_genre_id PK
        string nome_genero
    }

    dim_people {
        bigint sk_person_id PK
        string nome_pessoa
        string tipo_pessoa
    }

    dim_companies {
        bigint sk_company_id PK
        string nome_produtora
    }

    dim_reviews {
        bigint sk_review_id PK
        bigint sk_movie_id FK
        int qtd_avaliacoes_usuarios
        double nota_media_usuarios
    }

    bridge_movie_genre {
        bigint sk_movie_id FK
        bigint sk_genre_id FK
    }

    bridge_movie_person {
        bigint sk_movie_id FK
        bigint sk_person_id FK
    }

    bridge_movie_company {
        bigint sk_movie_id FK
        bigint sk_company_id FK
    }
```
